## **Como fazer um `join` de tabelas no pandas?**

In [1]:
import pandas as pd

In [2]:
table_1 = {
    "ID": [1, 2, 3, 4, 5, 6],
    "product": ["carro", "lasanha", "fruta", "café", "ovos", "frango"]
}
table_1_df = pd.DataFrame(table_1)

In [3]:
table_2 = {
    "ID": [1, 2, 3, 4, 5, 6],
    "tel": ["1231", "2234", "3243", "45345", "56434", "9898"],
    "altura": [1.70, 1.80, 1.45, 1.20, 2.00, 1.89],
    "age": [23, 22, 45, 35, 21, 56]
}
table_2_df = pd.DataFrame(table_2)

In [4]:
table_1_df

   ID  product
0   1    carro
1   2  lasanha
2   3    fruta
3   4     café
4   5     ovos
5   6   frango

In [5]:
table_2_df

   ID    tel  altura  age
0   1   1231    1.70   23
1   2   2234    1.80   22
2   3   3243    1.45   45
3   4  45345    1.20   35
4   5  56434    2.00   21
5   6   9898    1.89   56

In [6]:
table_1_df.merge(
    right=table_2_df,
    on="ID",
    how="inner",
)

   ID  product    tel  altura  age
0   1    carro   1231    1.70   23
1   2  lasanha   2234    1.80   22
2   3    fruta   3243    1.45   45
3   4     café  45345    1.20   35
4   5     ovos  56434    2.00   21
5   6   frango   9898    1.89   56